#+TITLE: A combinatorial solver for Laplacian QP over box constraints.
#+AUTHOR: Serge Kruk
#+EMAIL: sgkruk@gmail.com
#+DATE: $LastChangedDate: 2016-02-10 10:50:15 -0500 (Wed, 10 Feb 2016) $
#+OPTIONS: ^:nil
#+LATEX_CLASS: article
#+OPTIONS: toc:nil
#+LATEX_CLASS_OPTIONS: [10pt]
#+LATEX_HEADER: \usepackage{geometry,listings,amsmath,amssymb,amsthm,algorithm2e}
#+STARTUP: showall

* An experiment to verify runtime
We generate a set of ranges and run the solver, keeping track of the
number of steps in the algorithm.
#+BEGIN_SRC lisp :exports both
    (defun gen-ranges (n &optional acc)
      (if (zerop n)
          acc
          (let* ((start (random (* 3 n)))
                 (end (+ start 1 (random (* 6 n)))))
            (gen-ranges (1- n) (cons (list start end) acc)))))

  (defun experiment (ns)
  (let ((results '(("n" "steps"))))
    (dolist (n ns (nreverse results))
      (let ((steps 0)
            (nb 0))
        (dotimes (i 20)
          (multiple-value-bind (sol step) (solver (gen-ranges n))
  ;;(print sol)
            (incf steps step)
            (incf nb)))
        (push (list n (truncate steps nb)) results)))))
  (experiment '(10 20 30 50 100 200 300 500 1000 5000 10000))
#+END_SRC

#+RESULTS:
|     n | steps |
|    10 |     1 |
|    20 |     3 |
|    30 |     3 |
|    50 |     5 |
|   100 |    10 |
|   200 |    21 |
|   300 |    31 |
|   500 |    54 |
|  1000 |   108 |
|  5000 |   513 |
| 10000 |  1047 |
#+BEGIN_COMMENT
VERSION 0
Evaluation took:
  46.773 seconds of real time
  46.700000 seconds of total run time (46.700000 user, 0.000000 system)
  99.84% CPU
  168,386,529,416 processor cycles
  717,150,016 bytes consed
(("n" "steps") (10 2) (20 2) (30 4) (50 6) (100 10) (200 20) (300 30) (500 49)
 (1000 94))

VERSION 1
Evaluation took:
  0.213 seconds of real time
  0.216000 seconds of total run time (0.196000 user, 0.020000 system)
  [ Run times consist of 0.024 seconds GC time, and 0.192 seconds non-GC time. ]
  101.41% CPU
  765,672,318 processor cycles
  154,849,088 bytes consed
  
(("n" "steps") (10 2) (20 3) (30 4) (50 7) (100 11) (200 22) (300 33) (500 53)
 (1000 104))

We could improve this by using vectors instead of lists.
#+END_COMMENT
